# 변수 - 값을 저장하는 공간 (한&영 상관없지만 영어로 써야 오류가 적음)
# 변수는 의미가 있는 단어로 구성을 하면 더 좋음. (total, result 등)
# 예약어는 변수로 사용할 수 없음.
# 예약어 - 예) "print()"
# 타입 - 숫자, 문자열, 진실(참), 거짓

# C, java는 타입선언을 하지만, 파이썬은 타입선언이 없음. (그냥 변수만 지정하면 됨.)
# 변수 = 리터럴(값)
a = 10 # "10"이라는 값이 a에 저장됨.
number = 10
print = 10
print1 = 10
input1 = 10
# in*put = 10 특수문자는 _만 사용가능
# 10num = 10 숫자로 시작되는 변수는 사용할 수 없음
num10 = 10
n10um = 10
No = 10 # 대소문자 구별함.
no = 100
# n o = 10 / 공백은 사용할 수 없음.

print(print1)
print(input1)

num = 10
a2 = 123456789*321
a3 = a2+1000000 # a2라는 값에 백만원을 더한 값을 a3에 저장 (a3라는 변수에 저장)
result = a2+1000000
total = a2+1000000
hap = a2+1000000
b = 1.5
c = "안녕"
d = True
e = False

